# [Datenverarbeitung] Spalten analysieren

In [2]:
import pandas as pd

### CSV-Dateien importieren

In [3]:
umsatz = pd.read_csv("datengrundlage.csv")

In [4]:
umsatz.head()

,Nr,Datum,Jahr,Land,Stadt,Umsatz,Kosten,Rücksendung,Bereich,Produktgruppe,Logistik-Code,Kunde
0,1,1/1/2025,2025,Südkorea,Seoul,5534.55,4427.64,NaN,Bereich-5,prd-3,6-43647-1,C-85
1,2,1/2/2025,2025,Südkorea,Seoul,6284.70,7164.56,NaN,Bereich-5,prd-1,2-43647-1,C-107
2,3,1/3/2025,2025,Vereinigtes Königreich,London,5437.65,6198.92,NaN,Bereich-1,prd-56,7-43647-1,C-141
3,4,1/4/2025,2025,China,Peking,8587.20,5152.32,NaN,Bereich-2,prd-92,4-43647-1,C-124
4,5,1/5/2025,2025,USA,Los Angeles,9439.05,10382.95,NaN,Bereich-2,prd-85,1-43647-1,C-76

In [6]:
print(umsatz)

        Nr       Datum  Jahr                    Land        Stadt   Umsatz  \
0        1    1/1/2025  2025                Südkorea        Seoul  5534.55
1        2    1/2/2025  2025                Südkorea        Seoul  6284.70
2        3    1/3/2025  2025  Vereinigtes Königreich       London  5437.65
3        4    1/4/2025  2025                   China       Peking  8587.20
4        5    1/5/2025  2025                     USA  Los Angeles  9439.05
...    ...         ...   ...                     ...          ...      ...
1375  1376   10/7/2028  2028                Südkorea   Yangsan-si  6019.05
1376  1377   10/8/2028  2028                Südkorea   Yangsan-si  6482.40
1377  1378   10/9/2028  2028             Deutschland    Stuttgart  9192.15
1378  1379  10/10/2028  2028                  Mexiko      Torreón  9808.95
1379  1380  10/11/2028  2028                     USA   Sacramento  8303.55

        Kosten  Rücksendung    Bereich Produktgruppe Logistik-Code  Kunde
0      4427.64          NaN  Bereich-5         prd-3     6-43647-1   C-85
1      7164.56          NaN  Bereich-5         prd-1     2-43647-1  C-107
2      6198.92          NaN  Bereich-1        prd-56     7-43647-1  C-141
3      5152.32          NaN  Bereich-2        prd-92     4-43647-1  C-124
4     10382.95          NaN  Bereich-2        prd-85     1-43647-1   C-76
...        ...          ...        ...           ...           ...    ...
1375   4815.24          NaN  Bereich-3        prd-77     6-43663-1   C-85
1376   5185.92          NaN  Bereich-2        prd-96     5-43655-1   C-65
1377   7353.72          NaN  Bereich-1        prd-50     3-43673-1   C-65
1378   7847.16          1.0  Bereich-3        prd-72     8-43659-1  C-109
1379   6642.84          NaN  Bereich-2        prd-88     1-43654-2   C-76

[1380 rows x 12 columns]

### Einzelne Spalte auswählen

#### Variante 1

In [5]:
umsatz.Stadt

0             Seoul
1             Seoul
2            London
3            Peking
4       Los Angeles
           ...
1375     Yangsan-si
1376     Yangsan-si
1377      Stuttgart
1378        Torreón
1379     Sacramento
Name: Stadt, Length: 1380, dtype: object

In [8]:
print(type(umsatz))
print(type(umsatz.Stadt))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

#### Variante 2

In [9]:
umsatz["Stadt"]

0             Seoul
1             Seoul
2            London
3            Peking
4       Los Angeles
           ...
1375     Yangsan-si
1376     Yangsan-si
1377      Stuttgart
1378        Torreón
1379     Sacramento
Name: Stadt, Length: 1380, dtype: object

### Shape

In [10]:
umsatz["Stadt"].shape

(1380,)

In [11]:
len(umsatz)

1380

### Unique

In [13]:
umsatz.Stadt.unique()

array(['Seoul', 'London', 'Peking', 'Los Angeles', 'Berlin', 'Oaxaca',
       'Busan', 'Las Vegas', 'Shanghai', 'Seattle', 'München', 'Incheon',
       'Chongqing', 'Miami', 'Shenzhen', 'Daegu', 'Houston', 'Puebla',
       'Guangzhou', 'Hannover', 'Daejeon', 'Portland', 'Manchester',
       'Wuhan', 'Detroit', 'Veracruz', 'Gwangju', 'Ulsan', 'Dongguan',
       'Denver', 'Gangneung', 'Tianjin', 'Seogwipo', 'Dortmund',
       'Monterrey', 'Richmond', 'Bristol', 'Gunpo', 'Chuncheon',
       'Ciudad Juárez', 'Nanjing', 'San José', 'Liverpool', 'Suncheon',
       'Karlsruhe', 'Asan', 'Honolulu', 'Cancún', 'Pyeongtaek', 'Leeds',
       'Orlando', 'Freiburg', 'Mokpo', 'Jackson', 'Gimpo', 'Guanajuato',
       'Jinan', 'Osan', 'Leipzig', 'Baton Rouge', 'Paju',
       'San Luis Potosi', 'Naju', 'Bremen', 'Birmingham', 'Fort Worth',
       'Gimhae', 'Luoyang', 'Hartford', 'Durango', 'Salem', 'Hamburg',
       'Bucheon', 'Montgomery', 'Nürnberg', 'Shenyang', 'Anyang',
       'Topeka', 'Acapulco', 'Miryang', 'Phoenix', 'Stuttgart',
       'Quingdao', 'Torreón', 'Silheung', 'Leicester', 'Sacramento',
       'Yangsan-si'], dtype=object)

### nunique

In [15]:
umsatz.Stadt.nunique()

88

### nlargest

In [17]:
umsatz.nlargest(7, "Kosten")

,Nr,Datum,Jahr,Land,Stadt,Umsatz,Kosten,Rücksendung,Bereich,Produktgruppe,Logistik-Code,Kunde
1008,1009,10/6/2027,2027,Südkorea,Gimhae,10650.60,12141.68,NaN,Bereich-2,prd-80,5-43647-1,C-65
575,576,7/30/2026,2026,Südkorea,Suncheon,9959.10,11353.37,NaN,Bereich-5,prd-9,5-43675-1,C-65
1004,1005,10/2/2027,2027,USA,Hartford,9439.05,10760.52,NaN,Bereich-2,prd-85,1-43647-1,C-76
613,614,9/6/2026,2026,Deutschland,Karlsruhe,9219.75,10510.51,1.0,Bereich-1,prd-45,3-43647-2,C-65
651,652,10/14/2026,2026,USA,Honolulu,13112.40,10489.92,NaN,Bereich-5,prd-19,1-43658-2,C-76
4,5,1/5/2025,2025,USA,Los Angeles,9439.05,10382.95,NaN,Bereich-2,prd-85,1-43647-1,C-76
58,59,2/28/2025,2025,USA,Las Vegas,8631.45,9839.85,NaN,Bereich-1,prd-43,1-43655-1,C-76

### Mehrere Spalten auswählen

In [21]:
umsatz[["Stadt", "Land"]]

            Stadt                    Land
0           Seoul                Südkorea
1           Seoul                Südkorea
2          London  Vereinigtes Königreich
3          Peking                   China
4     Los Angeles                     USA
...           ...                     ...
1375   Yangsan-si                Südkorea
1376   Yangsan-si                Südkorea
1377    Stuttgart             Deutschland
1378      Torreón                  Mexiko
1379   Sacramento                     USA

[1380 rows x 2 columns]

In [20]:
umsatz[["Land", "Stadt"]]

                        Land        Stadt
0                   Südkorea        Seoul
1                   Südkorea        Seoul
2     Vereinigtes Königreich       London
3                      China       Peking
4                        USA  Los Angeles
...                      ...          ...
1375                Südkorea   Yangsan-si
1376                Südkorea   Yangsan-si
1377             Deutschland    Stuttgart
1378                  Mexiko      Torreón
1379                     USA   Sacramento

[1380 rows x 2 columns]